In [1]:
import numpy as np
import pandas as pd

In [3]:
date = pd.read_csv("orders.csv")
time = pd.read_csv("messages.csv")

In [4]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [5]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [6]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [7]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [8]:
# Convert to datetime datatype
date['date'] = pd.to_datetime(date['date'])

In [9]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

In [12]:
# Extract year
date['date_year'] = date['date'].dt.year
date.sample(5)

          date  product_id  city_id  orders  date_year
56  2018-11-12        3667       13      20       2018
484 2019-02-09        2123       16       1       2019
201 2019-04-06        2357       14     104       2019
683 2018-10-06        5957       26       2       2018
402 2018-11-05        4347       25     131       2018

In [13]:
# Extract month
date["date_month"] = date["date"].dt.month
date.sample(5)

          date  product_id  city_id  orders  date_year  date_month
851 2019-07-09        6128       22       1       2019           7
685 2019-02-28         212       13       1       2019           2
483 2019-10-30        5407       13      64       2019          10
577 2018-07-22        2974       26      15       2018           7
501 2019-01-24        1881       14      14       2019           1

In [14]:
date["date_month_name"] = date["date"].dt.month_name()

date.head()

,date,product_id,city_id,orders,date_year,date_month,date_month_name
0,2019-12-10,5628,25,3,2019,12,December
1,2018-08-15,3646,14,157,2018,8,August
2,2018-10-23,1859,25,1,2018,10,October
3,2019-08-17,7292,25,1,2019,8,August
4,2019-01-06,4344,25,3,2019,1,January

In [15]:
date["date_day"] = date["date"].dt.day

date.head()

,date,product_id,city_id,orders,date_year,date_month,date_month_name,date_day
0,2019-12-10,5628,25,3,2019,12,December,10
1,2018-08-15,3646,14,157,2018,8,August,15
2,2018-10-23,1859,25,1,2018,10,October,23
3,2019-08-17,7292,25,1,2019,8,August,17
4,2019-01-06,4344,25,3,2019,1,January,6

In [16]:
# day of week
date["date_dow"] = date["date"].dt.dayofweek

date.head()

,date,product_id,city_id,orders,date_year,date_month,date_month_name,date_day,date_dow
0,2019-12-10,5628,25,3,2019,12,December,10,1
1,2018-08-15,3646,14,157,2018,8,August,15,2
2,2018-10-23,1859,25,1,2018,10,October,23,1
3,2019-08-17,7292,25,1,2019,8,August,17,5
4,2019-01-06,4344,25,3,2019,1,January,6,6

In [17]:
# day of week - name

date["date_dow_name"] = date["date"].dt.day_name()

date.drop(columns=["product_id", "city_id", "orders"]).head()

,date,date_year,date_month,date_month_name,date_day,date_dow,date_dow_name
0,2019-12-10,2019,12,December,10,1,Tuesday
1,2018-08-15,2018,8,August,15,2,Wednesday
2,2018-10-23,2018,10,October,23,1,Tuesday
3,2019-08-17,2019,8,August,17,5,Saturday
4,2019-01-06,2019,1,January,6,6,Sunday

In [18]:
# is weekend?

date["date_is_weekend"] = np.where(
    date["date_dow_name"].isin(["Sunday", "Saturday"]), 1, 0
)

date.drop(columns=["product_id", "city_id", "orders"]).head()

,date,date_year,date_month,date_month_name,date_day,date_dow,date_dow_name,date_is_weekend
0,2019-12-10,2019,12,December,10,1,Tuesday,0
1,2018-08-15,2018,8,August,15,2,Wednesday,0
2,2018-10-23,2018,10,October,23,1,Tuesday,0
3,2019-08-17,2019,8,August,17,5,Saturday,1
4,2019-01-06,2019,1,January,6,6,Sunday,1

In [20]:
date["quarter"] = date["date"].dt.quarter

date.drop(columns=["product_id", "city_id", "orders"]).head()

,date,date_year,date_month,date_month_name,date_day,date_dow,date_dow_name,date_is_weekend,quarter
0,2019-12-10,2019,12,December,10,1,Tuesday,0,4
1,2018-08-15,2018,8,August,15,2,Wednesday,0,3
2,2018-10-23,2018,10,October,23,1,Tuesday,0,4
3,2019-08-17,2019,8,August,17,5,Saturday,1,3
4,2019-01-06,2019,1,January,6,6,Sunday,1,1

In [21]:
date["semester"] = np.where(date["quarter"].isin([1, 2]), 1, 2)

date.drop(columns=["product_id", "city_id", "orders"]).head()

,date,date_year,date_month,date_month_name,date_day,date_dow,date_dow_name,date_is_weekend,quarter,semester
0,2019-12-10,2019,12,December,10,1,Tuesday,0,4,2
1,2018-08-15,2018,8,August,15,2,Wednesday,0,3,2
2,2018-10-23,2018,10,October,23,1,Tuesday,0,4,2
3,2019-08-17,2019,8,August,17,5,Saturday,1,3,2
4,2019-01-06,2019,1,January,6,6,Sunday,1,1,1

In [22]:
import datetime

today = datetime.datetime.today()

today

datetime.datetime(2025, 11, 8, 17, 18, 24, 661894)

In [23]:
today - date["date"]

0     2160 days 17:18:24.661894
1     2642 days 17:18:24.661894
2     2573 days 17:18:24.661894
3     2275 days 17:18:24.661894
4     2498 days 17:18:24.661894
                 ...
995   2588 days 17:18:24.661894
996   2529 days 17:18:24.661894
997   2377 days 17:18:24.661894
998   2442 days 17:18:24.661894
999   2216 days 17:18:24.661894
Name: date, Length: 1000, dtype: timedelta64[ns]

In [24]:
(today - date["date"]).dt.days

0      2160
1      2642
2      2573
3      2275
4      2498
       ...
995    2588
996    2529
997    2377
998    2442
999    2216
Name: date, Length: 1000, dtype: int64

In [26]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [27]:
# Converting to datetime datatype
time["date"] = pd.to_datetime(time["date"])

In [28]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [29]:
time["hour"] = time["date"].dt.hour
time["min"] = time["date"].dt.minute
time["sec"] = time["date"].dt.second

time.head()

,date,msg,hour,min,sec
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0

In [30]:
time["time"] = time["date"].dt.time

time.head()

,date,msg,hour,min,sec,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0,00:31:00
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0,23:11:00

In [31]:
today - time["date"]

0     4346 days 16:28:24.661894
1     4210 days 17:38:24.661894
2     4696 days 16:57:24.661894
3     3998 days 16:47:24.661894
4     4395 days 18:07:24.661894
                 ...
995   4985 days 16:28:24.661894
996   4306 days 18:04:24.661894
997   4771 days 17:41:24.661894
998   4887 days 17:44:24.661894
999   4159 days 17:53:24.661894
Name: date, Length: 1000, dtype: timedelta64[ns]

In [32]:
(today - time["date"]) / np.timedelta64(1, "h")

0      104320.473517
1      101057.640184
2      112720.956851
3       95968.790184
4      105498.123517
           ...
995    119656.473517
996    103362.073517
997    114521.690184
998    117305.740184
999     99833.890184
Name: date, Length: 1000, dtype: float64

In [33]:
(today - time["date"]) / np.timedelta64(1, "m")

0      6.259228e+06
1      6.063458e+06
2      6.763257e+06
3      5.758127e+06
4      6.329887e+06
           ...
995    7.179388e+06
996    6.201724e+06
997    6.871301e+06
998    7.038344e+06
999    5.990033e+06
Name: date, Length: 1000, dtype: float64

In [34]:
(today - time["date"]) / np.timedelta64(1, "s")

0      3.755537e+08
1      3.638075e+08
2      4.057954e+08
3      3.454876e+08
4      3.797932e+08
           ...
995    4.307633e+08
996    3.721035e+08
997    4.122781e+08
998    4.223007e+08
999    3.594020e+08
Name: date, Length: 1000, dtype: float64